In [1]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import numpy as np 
import pandas as pd

# 데이타프레임 조회 

- 컬럼 조회 
- 행 조회 
- 컬럼+행 조회 

```
데이타프레임[컬럼명]
데이타프레임[[컬럼명1, 컬럼명2, 컬럼명3 ....]]

데이타프레임.컬럼명 

loc : location 행이름, 컬럼명 
데이타프레임.loc[행이름]
데이타프레임.loc[start:end]
데이타프레임.loc[start:end, start:end]


iloc : index location 행인덱스, 컬럼인덱스
데이타프레임.iloc[행인덱스]
데이타프레임.iloc[start:end]
데이타프레임.iloc[start:end, start:end]

```

In [4]:
data = { "name":["Haidi", "Haidi", "Haidi", "Charles", "Charles"],
        "year":[2014, 2015, 2016, 2015, 2017],
        "points":[1.5, 1.7, 3.6, 2.5, 2.9], 
        "penalty":[1, 2, 3, 4, 5] }
df1 = pd.DataFrame( data, 
                    index=["one", "two", "three", "four", "five"])
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [5]:
df1.columns

Index(['name', 'year', 'points', 'penalty'], dtype='object')

In [6]:
df1.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

##### [] 를 이용한 컬럼조회

In [7]:
# 특정 1개의 컬럼 조회 => 시리즈 
# 데이타프레임[컬럼명]
df1['name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [8]:
type(df1['name'])

pandas.core.series.Series

In [9]:
# 특정 1개의 컬럼 조회 => 데이타프레임
# 데이타프레임[[컬럼명]]
df1[['name']]

          name
one      Haidi
two      Haidi
three    Haidi
four   Charles
five   Charles

In [10]:
type(df1[['name']])

pandas.core.frame.DataFrame

In [12]:
# KeyError 
# df1[0]

In [13]:
# 다수개의 컬럼 조회 => 데이타프레임
# 데이타프레임[[컬럼명1, 컬럼명2 ...]]

In [16]:
df1[['year', 'name', 'points']]

       year     name  points
one    2014    Haidi     1.5
two    2015    Haidi     1.7
three  2016    Haidi     3.6
four   2015  Charles     2.5
five   2017  Charles     2.9

In [14]:
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5

In [19]:
# 에러 발생 : 슬라이싱 x
# df1[['name':'year']]

#####  도트(.) 를 이용한 특정 컬럼 조회  => 시리즈

In [21]:
df1.name

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

##### loc 방식으로 컬럼 조회 

- 데이타프레임.loc[:, 컬럼명] => 시리즈 
- 데이타프레임.loc[:, 컬럼명1:컬럼명2] => 데이타프레임

In [22]:
df1.loc[:, 'name']

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [23]:
# 컬럼명을 이용한 슬라이싱 
df1.loc[:, 'name':'points']

          name  year  points
one      Haidi  2014     1.5
two      Haidi  2015     1.7
three    Haidi  2016     3.6
four   Charles  2015     2.5
five   Charles  2017     2.9

##### iloc 방식으로 컬럼 조회  : 위치인덱스 숫자 이용

- 데이타프레임.iloc[:, 컬럼인덱스] => 시리즈 
- 데이타프레임.iloc[:, 컬럼인덱스1:컬럼인덱스2] => 데이타프레임

In [26]:
# 특정 컬럼 1개 
df1.iloc[:, 0]

one        Haidi
two        Haidi
three      Haidi
four     Charles
five     Charles
Name: name, dtype: object

In [29]:
# 연속 컬럼 슬라이싱 => 데이타프레임
df1.iloc[:, 0:2]

          name  year
one      Haidi  2014
two      Haidi  2015
three    Haidi  2016
four   Charles  2015
five   Charles  2017

##### loc 방식으로 행 조회 
- 데이타프레임.loc[인덱스명] => 시리즈 
- 데이타프레임.loc[[인덱스명]] => 데이타프레임
- 데이타프레임.loc[인덱스명, :] => 시리즈 
- 데이타프레임.loc[인덱스명1:인덱스명2, :] => 데이타프레임
- 데이타프레임.loc[[인덱스명1, 인덱스명2 ...], :] => 데이타프레임

In [32]:
# 특정행 조회 => 시리즈 
df1.loc['three']

name       Haidi
year        2016
points       3.6
penalty        3
Name: three, dtype: object

In [34]:
df1.loc['three', :]

name       Haidi
year        2016
points       3.6
penalty        3
Name: three, dtype: object

In [33]:
# 특정행 조회 => 데이타프레임 
df1.loc[['three']]

        name  year  points  penalty
three  Haidi  2016     3.6        3

In [35]:
# 불연속인 행 조회 - two, five
df1.loc[['two', 'five']]

         name  year  points  penalty
two     Haidi  2015     1.7        2
five  Charles  2017     2.9        5

In [36]:
# 연속적인 행 조회 => 데이타프레임 슬라이싱 
df1.loc['two':'four']

          name  year  points  penalty
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4

##### iloc 방식으로 행 조회  : 위치인덱스 숫자 이용

- 데이타프레임.iloc[행인덱스] => 시리즈 
- 데이타프레임.iloc[행인덱스1:행인덱스2] => 데이타프레임

In [37]:
# 마지막 행 
df1.iloc[-1]

name       Charles
year          2017
points         2.9
penalty          5
Name: five, dtype: object

In [42]:
# 슬라이싱
df1.iloc[1:4]

          name  year  points  penalty
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4

In [43]:
# 불연속인 행 조회 
df1.iloc[[0, 2, -1]]

          name  year  points  penalty
one      Haidi  2014     1.5        1
three    Haidi  2016     3.6        3
five   Charles  2017     2.9        5

In [20]:
df1

          name  year  points  penalty
one      Haidi  2014     1.5        1
two      Haidi  2015     1.7        2
three    Haidi  2016     3.6        3
four   Charles  2015     2.5        4
five   Charles  2017     2.9        5